Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes Constructor (Double, MarkSymbolShape)
 Creates a new mark symbol attributes instance with the given size and shape.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkBasicSymbolAttributes(
	double size,
	MarkSymbolShape shape
)
Public Sub New (
	size As Double,
	shape As MarkSymbolShape
)
Parameters
size
Type: System.Double
The size of the mark symbol to be used.
shape
Type: Tekla.Structures.Drawing.MarkSymbolShape
The shape of the mark symbol to be used.
See Also
Reference
ViewMarkBasicSymbolAttributes Class
ViewMarkBasicSymbolAttributes Overload
Tekla.Structures.Drawing Namespace